package com.myworld.swealth.property

interface Constants {
    companion object {
        /**
         * 国有银行、股份制商业银行、上市银行官方名称
         */
        val MAIN_BANK_NAMES = arrayOf(
            "中国工商银行股份有限公司",
            "中国农业银行股份有限公司",
            "中国银行股份有限公司",
            "中国建设银行股份有限公司",
            "交通银行股份有限公司",
            "中国邮政储蓄银行股份有限公司",
            "中信银行股份有限公司",
            "中国光大银行股份有限公司",
            "华夏银行股份有限公司",
            "中国民生银行股份有限公司",
            "招商银行股份有限公司",
            "兴业银行股份有限公司",
            "广发银行股份有限公司",
            "平安银行股份有限公司",
            "上海浦东发展银行股份有限公司",
            "恒丰银行股份有限公司",
            "浙商银行股份有限公司",
            "渤海银行股份有限公司",
            "江苏吴江农村商业银行股份有限公司",
            "郑州银行股份有限公司",
            "江苏张家港农村商业银行股份有限公司",
            "贵阳银行股份有限公司",
            "成都银行股份有限公司",
            "长沙银行股份有限公司",
            "江苏江阴农村商业银行股份有限公司",
            "无锡农村商业银行股份有限公司",
            "江苏常熟农村商业银行股份有限公司",
            "南京银行股份有限公司",
            "北京银行",
            "杭州银行股份有限公司",
            "宁波银行股份有限公司",
            "江苏银行股份有限公司",
            "青岛银行股份有限公司",
            "江苏紫金农村商业银行股份有限公司")
    }
}
